# DATABASE-CONNECT
Your one fine solution for the database tasks

**Databases** Available in version 0.1.5
1. MongoDb
2. Cassandra ( Datastax Astra )

In [1]:
#Install the latest package from pypi
!pip install database-connect

Requirement already satisfied: database-connect in d:\database-hub\src (0.1.5)
Requirement already satisfied: pymongo in d:\database-hub\env\lib\site-packages (from database-connect) (4.2.0)
Requirement already satisfied: dnspython in d:\database-hub\env\lib\site-packages (from database-connect) (2.2.1)
Requirement already satisfied: cassandra-driver in d:\database-hub\env\lib\site-packages (from database-connect) (3.25.0)
Requirement already satisfied: pandas in d:\database-hub\env\lib\site-packages (from database-connect) (1.3.5)
Requirement already satisfied: numpy in d:\database-hub\env\lib\site-packages (from database-connect) (1.21.6)
Requirement already satisfied: geomet<0.3,>=0.1 in d:\database-hub\env\lib\site-packages (from cassandra-driver->database-connect) (0.2.1.post1)
Requirement already satisfied: six>=1.9 in d:\database-hub\env\lib\site-packages (from cassandra-driver->database-connect) (1.16.0)
Requirement already satisfied: pytz>=2017.3 in d:\database-hub\env\lib\site-packages (from pandas->database-connect) (2022.2.1)
Requirement already satisfied: python-dateutil>=2.7.3 in d:\database-hub\env\lib\site-packages (from pandas->database-connect) (2.8.2)
Requirement already satisfied: click in d:\database-hub\env\lib\site-packages (from geomet<0.3,>=0.1->cassandra-driver->database-connect) (8.1.3)
Requirement already satisfied: importlib-metadata in d:\database-hub\env\lib\site-packages (from click->geomet<0.3,>=0.1->cassandra-driver->database-connect) (4.12.0)
Requirement already satisfied: colorama in d:\database-hub\env\lib\site-packages (from click->geomet<0.3,>=0.1->cassandra-driver->database-connect) (0.4.5)
Requirement already satisfied: typing-extensions>=3.6.4 in d:\database-hub\env\lib\site-packages (from importlib-metadata->click->geomet<0.3,>=0.1->cassandra-driver->database-connect) (4.3.0)
Requirement already satisfied: zipp>=0.5 in d:\database-hub\env\lib\site-packages (from importlib-metadata->click->geomet<0.3,>=0.1->cassandra-driver->database-connect) (3.8.1)

In [14]:
import database_connect as connection
import pandas as pd

## For MongoDb Operation

In [15]:
#call the mongodb connection 
client_url =  "mongodb+srv://hrisikesh-Neogi:hrisikesh123@database-connect.xf7zdae.mongodb.net/?retryWrites=true&w=majority"   # I have created a demo connection for you to understand. You can use your own.
database = "database-connect-testing"
collection_name = "test_1"

mongo = connection.mongo_operation(
                    client_url=client_url,
                    database_name= database,
                    collection_name=collection_name
                            )

### Performing C-R-U-D on Mongodb

In [16]:
#inserting single and multiple records in mongodb

#single record
data = {'name': 'Hrisikesh Neogi',
        'Job': 'Jr. Data Scientist'}
mongo.insert_record(data)
print("single data inserted")

#multiple record insertion

record = [
    {
        'name': 'Hrisikesh Neogi',
        'Job': 'Jr. Data Scientist'
    },
    {
        'name': 'Sudhanshu Kumar',
        'Job': 'CEO'
    }
]

mongo.insert_record(record)
print('multiple record inserted')

single data inserted
multiple record inserted

### You can insert csv/excel/pandas dataframe directly into the database. check the codes below
###### first, we will be setting new database and collection name and then we will insert   csv/excel dataframe into the database

In [17]:
#Reading the data

df = mongo.find()
df #this returns a pandas dataframe directly

                        _id             name                 Job
0  63133324efb6317a47e14c01  Hrisikesh Neogi  Jr. Data Scientist
1  63133325efb6317a47e14c03  Hrisikesh Neogi  Jr. Data Scientist
2  63133325efb6317a47e14c04  Sudhanshu Kumar                 CEO

In [18]:
#let's update the records

#update one record
where_condition = {"name": "Sudhanshu Kumar"}
update_query = {"Job":"CEO and Data Scientist"}
mongo.update(where_condition, update_query)
print("updated in mongodb")

#let's check by reading the data again
mongo.find()

updated in mongodb

                        _id             name                     Job
0  63133324efb6317a47e14c01  Hrisikesh Neogi      Jr. Data Scientist
1  63133325efb6317a47e14c03  Hrisikesh Neogi      Jr. Data Scientist
2  63133325efb6317a47e14c04  Sudhanshu Kumar  CEO and Data Scientist

In [19]:
#let's update all, we just need to pass a parameter

where_condition = {"name": "Sudhanshu Kumar"}
update_query = {"Job":"CEO and Data Scientist"}
mongo.update(where_condition, update_query,update_all_data=True)
print("updated in mongodb")

#let's check by reading the data again
mongo.find()

updated in mongodb

                        _id             name                     Job
0  63133324efb6317a47e14c01  Hrisikesh Neogi      Jr. Data Scientist
1  63133325efb6317a47e14c03  Hrisikesh Neogi      Jr. Data Scientist
2  63133325efb6317a47e14c04  Sudhanshu Kumar  CEO and Data Scientist

In [20]:
#delete one data
where_condition = {'name':'Sudhanshu Kumar'}
mongo.delete_record(where_condition)
print("Data deleted")
#let's check by reading the data again
mongo.find()

Data deleted

                        _id             name                 Job
0  63133324efb6317a47e14c01  Hrisikesh Neogi  Jr. Data Scientist
1  63133325efb6317a47e14c03  Hrisikesh Neogi  Jr. Data Scientist

In [21]:
#delete many records based on a single condition

#delete multiple data
where_condition = {'name':'Sudhanshu Kumar'}
mongo.delete_record(where_condition, delete_all=True)
print("Data deleted")
#let's check by reading the data again
mongo.find()

Data deleted

                        _id             name                 Job
0  63133324efb6317a47e14c01  Hrisikesh Neogi  Jr. Data Scientist
1  63133325efb6317a47e14c03  Hrisikesh Neogi  Jr. Data Scientist

In [22]:
#you can set new column and database names using following methods
mongo.set_new_database = 'new_Database'
mongo.set_new_collection = "new_collection"

In [23]:
#let's find the data in the new database and collection. It should give us error as the column and database is not created yet because we have not inserted any data there.
mongo.find()

NameError: Collection not found in mongo database. Following could be the reason.
                              1. Check the spelling or check the name of the collection.
                              2. It might be possible that the collection is empty and does not contain any data. Try to insert some data and then try to find the data.
                              3. The collection is yet not created.
                              4. If you have changed the name of the collection or database, check whether it contains some data or not.

In [24]:
#let's insert new data to new database and table
new_data = {'new_name': 'rishi'}
mongo.insert_record(new_data)
print('data inserted')
print("let's find the data")
mongo.find()

data inserted
let's find the data

                        _id new_name
0  63133349efb6317a47e14c14    rishi

In [25]:
#let's upload the csv data into new collection

mongo.set_new_collection = "bulk_data_collection"
#you can insert csv/excel files or pandas dataframe object directly.
#we will be reading the iris dataset

url = "https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv"
bulk_data = pd.read_csv(url)

#let's pass the dataframe object
mongo.bulk_insert(bulk_data)
print("bulk data inserted fro pandas dataframe object")

#you can pass the url directly also or your local csv file path

mongo.bulk_insert(url)
print("bulk data inserted from path/url")

bulk data inserted fro pandas dataframe object
bulk data inserted from path/url

In [26]:
#let's find the data
mongo.find()

,_id,sepal_length,sepal_width,petal_length,petal_width,species
0,631333b5efb6317a47e14c15,5.1,3.5,1.4,0.2,setosa
1,631333b5efb6317a47e14c16,4.9,3.0,1.4,0.2,setosa
2,631333b5efb6317a47e14c17,4.7,3.2,1.3,0.2,setosa
3,631333b5efb6317a47e14c18,4.6,3.1,1.5,0.2,setosa
4,631333b5efb6317a47e14c19,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...
295,631333b5efb6317a47e14d3c,6.7,3.0,5.2,2.3,virginica
296,631333b5efb6317a47e14d3d,6.3,2.5,5.0,1.9,virginica
297,631333b5efb6317a47e14d3e,6.5,3.0,5.2,2.0,virginica
298,631333b5efb6317a47e14d3f,6.2,3.4,5.4,2.3,virginica
299,631333b5efb6317a47e14d40,5.9,3.0,5.1,1.8,virginica

### The dataset we were using has 150 rows. So it is proven that both the pandas dataframe and url is being utilised properly.

# Cassandra Operations

In [1]:
#for cassandra operations

import database_connect as connection

zip_path = r'C:\Users\hrisi\Downloads\secure-connect-database-connect.zip'
client_id = 'IyjyLtbIhHFEgSaUXITWzNam'
client_secret = '+wloq09dqem7-UFM3eM9NdWyvphzRK1NdcMaPJDozs0olMTEXJny,EUek_D4ShtIY4x4QF6eZ-pjwHZOb-qF3SfwAeJ9kg+x3fcZS-QE8E-vR3LLl5hyAALPkxZRy+Eo'
keyspace = 'testing'   #note: keyspace should be created manually in datastax cassandra. Keyspaces are not allowed to create from backend.
table_name = 'test_2'

cassandra = connection.cassandra_operations(zip_path,
                                            client_id,
                                            client_secret,
                                            keyspace,
                                            table_name)

In [5]:
#column names should be created along with the data types. 
# check the data types available in cassandra at - 
#https://docs.datastax.com/en/cql-oss/3.x/cql/cql_reference/cql_data_types_c.html

columns = "name text primary key, job text, age int"
cassandra.create_table(columns=columns)
print('table created')

AlreadyExists: Table 'testing.test_2' already exists

### If table would be available it would throgh error, so you must be carefull while creating the tables

In [7]:
#let's create another table
columns = "name text primary key, job text, age int"
cassandra.table = 'final_test'
cassandra.create_table(columns=columns)
print('table created')

table created

In [8]:
#insert data 
columns = "name text primary key, job text, age int"
data_to_upload = "Hrisikesh Neogi, Jr.Data Scientist, 22"  #should be comma seperated string and follow the order of the columns
cassandra.insert_data(columns=columns,values=data_to_upload)
print("data uploaded")

data uploaded

In [9]:
#read data

data_in_cassandra = cassandra.read_data()
data_in_cassandra

              name  age                 job
0  Hrisikesh Neogi   22   Jr.Data Scientist

In [3]:
#bulk insert
#You can insert csv/excel/pandas dataframe directly into the database. check the codes below

#let's upload the csv data into new collection

#you can insert csv/excel files or pandas dataframe object directly.
#we will be reading the iris dataset
import pandas as pd

url = "https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv"
bulk_data = pd.read_csv(url)

#let's pass the dataframe object
cassandra.bulk_upload(bulk_data)
print("bulk data inserted fro pandas dataframe object")

#you can pass the url directly also or your local csv file path

cassandra.bulk_upload(url)
print("bulk data inserted from path/url")

Exception:  Error happend:
            The table name which is assigned while calling the cassandra operations class
            does not match the column names of the dataset.
            You can set some parameters to handle the error.
            set:
                create_new_table = True
                table_name = yourPreferredName

#### See the error message! We need to create seperate table with proper table names in order to bulk insert data. 
#### There are some parameters that we can use, check it out below

In [4]:
cassandra.bulk_upload(
    data = bulk_data,
    table_name='new_table_for_bulk',
    create_new_table=True)   #setting create_new_table = True will create a new table with the columns of our feeded data. Make sure to pass the table name while creating the new table here.

new table created
data uploaded successfully

### So, we have created a new table for our bulk data. 
**Note** - All the he columns of the newly created table will be by default text. So make sure you note that.

In [6]:
#update data

cassandra.read_data(table_name='final_test')

              name  age                 job
0  Hrisikesh Neogi   22   Jr.Data Scientist

In [2]:
#let's update the final_test table
where_condition = {'name':'Hrisikesh Neogi'}
update_statement = {'Job': 'Junior Data Scientist'}
cassandra.update_table(update_statement=update_statement,where_condition=where_condition, table_name='final_test') #you can set the table_name parameter to avoid assigning another name to cassandra.table. In this way this won't affect the primary assigning.

print("table updated")

#let's check the updated data
cassandra.read_data('final_test')

table updated

              name  age                    job
0  Hrisikesh Neogi   22  Junior Data Scientist

### So, it is clearly visible that I updated the job title.

In [2]:
#delete
#first, let's add some more data

columns = 'name, age, job'
values = "Rishi,34, Student"
table_name = 'test_1'
cassandra.insert_data(columns,values,table_name=table_name)
#read_Data
cassandra.read_data(table_name)

              name  age                    job
0  Hrisikesh Neogi   22  Junior Data Scientist
1            Rishi   34                Student

In [2]:
#let's delete the data with name = Rishi
condition = {'name':'Rishi'}
cassandra.delete_record(condition, table_name='test_1')
print('data deleted')
#read_data
cassandra.read_data('test_1')

data deleted

              name  age                    job
0  Hrisikesh Neogi   22  Junior Data Scientist

### We can clearly see that the data got deleted successfully.

##### New versions are coming up..
_update will be shared here_